11/data/attachments/e2e31f3379e24704.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_83b69bfa-14d6-4319-8bb0-2aa5560a6430</nif:username>
            <nif:friendToBeAdded>David_blood_Friend_88080_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>